Repository: pingfangx/TranslatorX-other
Catalog: JavaDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: General category "Mn" in the Unicode specification.
zh_cn: Unicode 规范中的常规类别“Mn”。

source: General category "Nd" in the Unicode specification.
zh_cn: Unicode 规范中的常规类别“Nd”。

source: General category "Nl" in the Unicode specification.
zh_cn: Unicode 规范中的常规类别“Nl”。

source: General category "No" in the Unicode specification.
zh_cn: Unicode 规范中的常规类别“No”。

source: General category "Pc" in the Unicode specification.
zh_cn: Unicode 规范中的常规类别“Pc”。

source: General category "Pd" in the Unicode specification.
zh_cn: Unicode 规范中的常规类别“Pd”。

source: General category "Pe" in the Unicode specification.
zh_cn: Unicode 规范中的常规类别“Pe”。

source: General category "Pf" in the Unicode specification.
zh_cn: Unicode 规范中的常规类别“Pf”。

source: General category "Pi" in the Unicode specification.
zh_cn: Unicode 规范中的常规类别“Pi”。

source: General category "Po" in the Unicode specification.
zh_cn: Unicode 规范中的常规类别“Po”。

source: General category "Ps" in the Unicode specification.
zh_cn: Unicode 规范中的常规类别“Ps”。

source: General category "Sc" in the Unicode specification.
zh_cn: Unicode 规范中的常规类别“Sc”。

source: General category "Sk" in the Unicode specification.
zh_cn: Unicode 规范中的常规类别“Sk”。

source: General category "Sm" in the Unicode specification.
zh_cn: Unicode 规范中的常规类别“Sm”。

source: General category "So" in the Unicode specification.
zh_cn: Unicode 规范中的常规类别“So”。

source: General category "Zl" in the Unicode specification.
zh_cn: Unicode 规范中的常规类别“Zl”。

source: General category "Zp" in the Unicode specification.
zh_cn: Unicode 规范中的常规类别“Zp”。

source: General category "Zs" in the Unicode specification.
zh_cn: Unicode 规范中的常规类别“Zs”。

source: Generally speaking, any class that implements the Comparable interface and violates this condition should clearly indicate this fact.
zh_cn: 一般来说，任何实现 Comparable 接口和违背此条件的类都应该清楚地指出这一事实。

source: Generally, this corresponds to the SourceFile attribute of the relevant class file (as per The Java Virtual Machine Specification, Section 4.7.7).
zh_cn: 通常，这对应于相关 class 文件的 SourceFile 属性（根据 The Java Virtual Machine Specification 中的第 4.7.7 小节）。

source: Generally, this is derived from the LineNumberTable attribute of the relevant class file (as per The Java Virtual Machine Specification, Section 4.7.8).
zh_cn: 通常，该方法派生自相关 class 文件的 LineNumberTable 属性（根据 The Java Virtual Machine Specification 中的第 4.7.8 小节）。

source: Get news & tips
zh_cn: 获取新闻和提示

source: Get the thrown target exception.
zh_cn: 获取抛出的目标异常。

source: Get the value of the accessible flag for this object.
zh_cn: 获取此对象的 accessible 标志的值。

source: Get/put, compact, views; allocate, wrap
zh_cn: Get/put，压缩，查看；分配，包装

source: Get/put, compact; allocate, wrap
zh_cn: Get/put，压缩；分配，包装

source: Gets the package for this class.
zh_cn: 获取此类的包。

source: Gets the signers of this class.
zh_cn: 获取此类的标记。

source: Gets the system property indicated by the specified key.
zh_cn: 获取用指定键描述的系统属性。

source: Gets the value of a static or instance boolean field.
zh_cn: 获取一个静态或实例 boolean 字段的值。

source: Gets the value of a static or instance byte field.
zh_cn: 获取一个静态或实例 byte 字段的值。

source: Gets the value of a static or instance field of type char or of another primitive type convertible to type char via a widening conversion.
zh_cn: 获取 char 类型或另一个通过扩展转换可以转换为 char 类型的基本类型的静态或实例字段的值。

source: Gets the value of a static or instance field of type double or of another primitive type convertible to type double via a widening conversion.
zh_cn: 获取 double 类型或另一个通过扩展转换可以转换为 double 类型的基本类型的静态或实例字段的值。

source: Gets the value of a static or instance field of type float or of another primitive type convertible to type float via a widening conversion.
zh_cn: 获取 float 类型或另一个通过扩展转换可以转换为 float 类型的基本类型的静态或实例字段的值。

source: Gets the value of a static or instance field of type int or of another primitive type convertible to type int via a widening conversion.
zh_cn: 获取 int 类型或另一个通过扩展转换可以转换为 int 类型的基本类型的静态或实例字段的值。

source: Gets the value of a static or instance field of type long or of another primitive type convertible to type long via a widening conversion.
zh_cn: 获取 long 类型或另一个通过扩展转换可以转换为 long 类型的基本类型的静态或实例字段的值。

source: Gets the value of a static or instance field of type short or of another primitive type convertible to type short via a widening conversion.
zh_cn: 获取 short 类型或另一个通过扩展转换可以转换为 short 类型的基本类型的静态或实例字段的值。

source: Gets the value of the specified environment variable.
zh_cn: 获取指定的环境变量值。

source: Given a proxy instance proxy and one of the interfaces implemented by its proxy class Foo, the following expression will return true:
zh_cn: 提供代理实例 proxy 和一个由其代理类 Foo 实现的接口，以下表达式将返回 true：

source: Given the binary name of a class, a class loader should attempt to locate or generate data that constitutes a definition for the class.
zh_cn: 如果给定类的二进制名称，那么类加载器会试图查找或生成构成类定义的数据。

source: Going from strongest to weakest, the different levels of reachability reflect the life cycle of an object.
zh_cn: 从最强到最弱，不同的可到达性级别反映了对象的生命周期。

source: Hash table and linked list implementation of the Map interface, with predictable iteration order.
zh_cn: Map 接口的哈希表和链接列表实现，具有可预知的迭代顺序。

source: Hash table and linked list implementation of the Set interface, with predictable iteration order.
zh_cn: 具有可预知迭代顺序的 Set 接口的哈希表和链接列表实现。

source: Hash table based implementation of the Map interface, with weak keys.
zh_cn: 以 弱键 实现的基于哈希表的 Map。

source: Hash table based implementation of the Map interface.
zh_cn: 基于哈希表的 Map 接口的实现。

source: Here are brief descriptions of the main components.
zh_cn: 下面简要描述主要的组件。

source: Here are some more examples of how strings can be used:
zh_cn: 下面给出了一些如何使用字符串的更多示例：

source: Here is an example that starts a process with a modified working directory and environment:
zh_cn: 下面是一个利用修改过的工作目录和环境启动进程的例子：

source: Here is an example:
zh_cn: 下面是一个示例：

source: Here, an attempt to queue a task will fail if no threads are immediately available to run it, so a new thread will be constructed.
zh_cn: 在此，如果不存在可用于立即运行任务的线程，则试图把任务加入队列将失败，因此会构造一个新的线程。

source: High level API
zh_cn: 高级 API

source: Higher values decrease the space overhead but increase the lookup cost (reflected in most of the operations of the HashMap class, including get and put).
zh_cn: 加载因子过高虽然减少了空间开销，但同时也增加了查询成本（在大多数 HashMap 类的操作中，包括 get 和 put 操作，都反映了这一点）。

source: Holds cached entrySet().
zh_cn: 持有的缓存的 entrySet()。

source: Hook methods
zh_cn: 钩子 (hook) 方法

source: However on some platforms, support may entail some form of internal locking.
zh_cn: 但是在某些平台上，该支持可能需要某种形式的内部锁。

source: However, all instances representing a type variable must be equal() to each other.
zh_cn: 不过，表示类型变量的所有实例彼此必须相等 (equal())。

source: However, an indefinite amount of time may elapse between a time-out being detected and a thread actually executing again after that time-out.
zh_cn: 但是，在检测超时与超时之后再次实际执行线程之间可能要经过不确定的时间。

source: However, its subclasses still need to register themselves if they are parallel capable.
zh_cn: 但是，如果其子类具有并行能力，则仍需要注册它们自己。

source: However, programmers are urged to use the more convenient Executors factory methods newCachedThreadPool() (unbounded thread pool, with automatic thread reclamation), newFixedThreadPool(int) (fixed size thread pool) and newSingleThreadExecutor() (single background thread), that preconfigure settings for the most common usage scenarios.
zh_cn: 但是，强烈建议程序员使用较为方便的 Executors 工厂方法 newCachedThreadPool()（无界线程池，可以进行自动线程回收）、newFixedThreadPool(int)（固定大小线程池）和 newSingleThreadExecutor()（单个后台线程），它们均为大多数使用场景预定义了设置。

source: However, since the vast majority of bins in normal use are not overpopulated, checking for existence of tree bins may be delayed in the course of table methods.
zh_cn: 然而，大多数情况下 bin 容量不会过大，检查树 bin 的存在可能会延时到 table 方法中。

source: However, some classes may not originate from a file; they may originate from other sources, such as the network, or they could be constructed by an application.
zh_cn: 然而，有些类可能并非源自一个文件；它们可能源自其他来源（如网络），也可能是由应用程序构造的。

source: However, sometimes (currently only upon Iterator.remove), the root might be elsewhere, but can be recovered following parent links (method TreeNode.root()).
zh_cn: 但是，有时（当前仅在 Iterator.remove 时）根可能在其他地方，但可以用父链接取得（方法 TreeNode.root()）。

source: However, the method may be useful for updating counters and statistics when such updates are unrelated to the other happens-before orderings of a program.
zh_cn: 但是，在这样的更新与程序的其他 happen-before 排序不相关时，该方法可用于更新计数器和统计数据。

source: However, the method was never implemented.
zh_cn: 不过，该方法决不会被实现。

source: However, the programmer should be aware that producing distinct integer results for unequal objects may improve the performance of hash tables.
zh_cn: 但是，程序员应该意识到，为不相等的对象生成不同整数结果可以提高哈希表的性能。

source: I/O facility.
zh_cn: I/O 族。

source: Ideally, under random hashCodes, the frequency of nodes in bins follows a Poisson distribution (http://en.wikipedia.org/wiki/Poisson_distribution) with a parameter of about 0.5 on average for the default resizing threshold of 0.75, although with a large variance because of resizing granularity.
zh_cn: 对于默认的 resizing 阈值 0.75 ，bin 中节点的频率遵循泊松分布（http://en.wikipedia.org/wiki/Poisson_distribution），参数约为 0.5，尽管由于 resizing 粒度会具有很大的变动。

source: Identifies the set of all public members of a class or interface, including inherited members.
zh_cn: 标识类或接口的所有公共成员（包括继承成员）的集合。

source: Identifies the set of declared members of a class or interface.
zh_cn: 标识类或接口的所有已声明成员的集合。

source: If componentType represents a non-array class or interface, the new array has dimensions.length dimensions and componentType as its component type.
zh_cn: 如果 componentType 表示一个非数组类或接口，则新数组具有 dimensions.length 维度，并且将 componentType 作为其组件类型。

source: If s is null, then the four characters "null" are appended.
zh_cn: 如果 s 为 null，则追加 4 个字符 "null"。

source: If s is null, then the four characters "null" are inserted into this sequence.
zh_cn: 如果 s 为 null，则向此序列中插入 4 个字符 "null"。

source: If s is null, then this method appends characters as if the s parameter was a sequence containing the four characters "null".
zh_cn: 如果 s 为 null，则认为 s 参数包含 4 个字符 "null"，并以此为根据添加字符。

source: If s is null, then this method inserts characters as if the s parameter was a sequence containing the four characters "null".
zh_cn: 如果 s 为 null，则认为 s 参数包含 4 个字符 "null"，并以此为根据插入字符。

source: If timeout is zero, however, then real time is not taken into consideration and the thread simply waits until notified.
zh_cn: 但是，如果 timeout 为零，则不考虑实际时间，在获得通知前该线程将一直等待。

source: If str is null, then the four characters "null" are appended.
zh_cn: 如果 str 为 null，则追加 4 个字符 "null"。

source: If str is null, then the four characters "null" are inserted into this sequence.
zh_cn: 如果 s 为 null，则向此序列中插入 4 个字符 "null"。

source: If start is equal to end, no changes are made.
zh_cn: 如果 start 等于 end，则不发生任何更改。

source: If componentType represents an array class, the number of dimensions of the new array is equal to the sum of dimensions.length and the number of dimensions of componentType.
zh_cn: 如果 componentType 表示一个数组类，则新数组的维数等于 dimensions.length 和 componentType 的维数的总和。

source: If sb is null, then the four characters "null" are appended to this sequence.
zh_cn: 如果 sb 为 null，则向该序列追加 4 个字符 "null"。

source: If sb is null, then the four characters "null" are appended to this StringBuffer.
zh_cn: 如果 sb 为 null，则将 4 个字符 "null" 追加到此 StringBuffer 中。

source: If a ThreadFactory fails to create a thread when asked by returning null from newThread, the executor will continue, but might not be able to execute any tasks.
zh_cn: 如果从 newThread 返回 null 时 ThreadFactory 未能创建线程，则执行程序将继续运行，但不能执行任何任务。

source: If a Target meta-annotation is not present on an annotation type declaration, the declared type may be used on any program element.
zh_cn: 如果注释类型声明中不存在 Target 元注释，则声明的类型可以用在任一程序元素上。

source: If a checked exception is thrown by this method that is not assignable to any of the exception types declared in the throws clause of the interface method, then an UndeclaredThrowableException containing the exception that was thrown by this method will be thrown by the method invocation on the proxy instance.
zh_cn: 如果此方法抛出经过检查的异常，该异常不可分配到在接口方法的 throws 子句中声明的任一异常类型，代理实例的方法调用将抛出包含此方法曾抛出的异常的 UndeclaredThrowableException。

source: If a class and all of its superclasses (except Object) obey this convention, it will be the case that x.clone().getClass() == x.getClass().
zh_cn: 如果一个类及其所有的超类（Object 除外）都遵守此约定，则 x.clone().getClass() == x.getClass()。

source: If a class contains only primitive fields or references to immutable objects, then it is usually the case that no fields in the object returned by super.clone need to be modified.
zh_cn: 如果一个类只包含基本字段或对不变对象的引用，那么通常不需要修改 super.clone 返回的对象中的字段。

source: If a method always has an error less than 0.5 ulps, the method always returns the floating-point number nearest the exact result; such a method is correctly rounded.
zh_cn: 如果一个方法的误差总是小于 0.5 ulp，那么该方法始终返回最接近准确结果的浮点数；这种方法就是正确舍入。

source: If a method is annotated with this annotation type compilers are required to generate an error message unless at least one of the following conditions hold:
zh_cn: 如果使用此批注类型对方法进行批注，则编译器需要生成错误消息，除非至少满足以下条件之一：

source: If a name is not specified when a thread is created, a new name is generated for it.
zh_cn: 如果线程创建时没有指定标识名，就会为其生成一个新名称。

source: If a proxy class for the same permutation of interfaces has already been defined by the class loader, then the existing proxy class will be returned; otherwise, a proxy class for those interfaces will be generated dynamically and defined by the class loader.
zh_cn: 如果类加载器已经定义了具有相同排列接口的代理类，那么现有的代理类将被返回；否则，类加载器将动态生成并定义这些接口的代理类。

source: If a proxy class implements a non-public interface, then it will be defined in the same package as that interface.
zh_cn: 如果代理类实现了非公共接口，那么它将在与该接口相同的包中定义。

source: If a proxy interface contains a method with the same name and parameter signature as the hashCode, equals, or toString methods of java.lang.Object, when such a method is invoked on a proxy instance, the Method object passed to the invocation handler will have java.lang.Object as its declaring class.
zh_cn: 如果代理接口包含某一方法，它的名称和参数签名与 java.lang.Object 的 hashCode、equals 或 toString 方法相同，那么在代理实例上调用这样的方法时，传递到调用处理程序的 Method 对象将使 java.lang.Object 成为其声明类。

source: If a registered reference becomes unreachable itself, then it will never be enqueued.
zh_cn: 如果一个已注册的引用本身变得不可到达，则永远不会将它加入到队列中。

source: If a request cannot be queued, a new thread is created unless this would exceed maximumPoolSize, in which case, the task will be rejected.
zh_cn: 如果无法将请求加入队列，则创建新的线程，除非创建此线程超出 maximumPoolSize，在这种情况下，任务将被拒绝。

source: If a security manager exists, its checkPermission method is called with a RuntimePermission("getenv.*") permission.
zh_cn: 如果安全管理器存在，则其 checkPermission 方法通过 RuntimePermission("getenv.*") 权限进行调用。

source: If a thread has not had its UncaughtExceptionHandler explicitly set, then its ThreadGroup object acts as its UncaughtExceptionHandler.
zh_cn: 如果某一线程没有明确设置其 UncaughtExceptionHandler，则将它的 ThreadGroup 对象作为其 UncaughtExceptionHandler。

source: If a type declaration is annotated with Documented, its annotations become part of the public API of the annotated elements.
zh_cn: 如果类型声明是用 Documented 来注释的，则其注释将成为注释元素的公共 API 的一部分。

source: If a type variable t is referenced by a type (i.e, class, interface or annotation type) T, and T is declared by the nth enclosing class of T (see JLS 8.1.2), then the creation of t requires the resolution (see JVMS 5) of the ith enclosing class of T, for i = 0 to n, inclusive.
zh_cn: 如果类型变量 t 由类型（即类、接口或注释类型）T 引用，而且 T 由 T 的第 n 个封闭类声明（请参见 JLS 8.1.2），那么创建 t 需要解析（请参见 JVMS 5）T 的第 i 个封闭类，其中 i = 0 到 n（包含）。

source: If an Inherited meta-annotation is present on an annotation type declaration, and the user queries the annotation type on a class declaration, and the class declaration has no annotation for this type, then the class's superclass will automatically be queried for the annotation type.
zh_cn: 如果在注释类型声明中存在 Inherited 元注释，并且用户在某一类声明中查询该注释类型，同时该类声明中没有此类型的注释，则将在该类的超类中自动查询该注释类型。

source: If an annotation returned by a method in this interface contains (directly or indirectly) a Class-valued member referring to a class that is not accessible in this VM, attempting to read the class by calling the relevant Class-returning method on the returned annotation will result in a TypeNotPresentException.
zh_cn: 如果此接口中的方法返回的注释（直接或间接地）包含一个已赋值的 Class 成员，该成员引用了一个在此 VM 中不可访问的类，则试图通过在返回的注释上调用相关的类返回的方法来读取该类，将导致一个 TypeNotPresentException。

source: If an uncaught exception is thrown by the finalize method, the exception is ignored and finalization of that object terminates.
zh_cn: 如果 finalize 方法抛出未捕获的异常，那么该异常将被忽略，并且该对象的终结操作将终止。

source: If another thread ever attempted to lock this resource, deadlock would result.
zh_cn: 如果另一个线程曾试图锁定该资源，则会出现死锁。

source: If any of the objects previously protected by these monitors were in an inconsistent state, the damaged objects become visible to other threads, potentially resulting in arbitrary behavior.
zh_cn: 如果这些监视器以前保护的任何对象处于不一致状态，则损坏的对象对其他线程可见，可能导致任意行为。

source: If any of these restrictions are violated, Proxy.getProxyClass will throw an IllegalArgumentException.
zh_cn: 如果违反了这些限制，Proxy.getProxyClass 将抛出 IllegalArgumentException。

source: If any threads are waiting on this object, one of them is chosen to be awakened.
zh_cn: 如果所有线程都在此对象上等待，则会选择唤醒其中一个线程。

source: If corePoolSize or more threads are running, the Executor always prefers queuing a request rather than adding a new thread.
zh_cn: 如果运行的线程等于或多于 corePoolSize，则 Executor 始终首选将请求加入队列，而不添加新的线程。

source: If correct handling of supplementary characters is required, determine the number of chars to remove by calling Character.charCount(thisSequence.codePointAt(index)), where thisSequence is this sequence.
zh_cn: 如果需要准确处理增补字符，那么可以通过调用 Character.charCount(thisSequence.codePointAt(index))（用此序列取代 thisSequence）来确定要移除的 char 数。

source: If fewer than corePoolSize threads are running, the Executor always prefers adding a new thread rather than queuing.
zh_cn: 如果运行的线程少于 corePoolSize，则 Executor 始终首选添加新的线程，而不进行排队。

source: If hook, callback, or BlockingQueue methods throw exceptions, internal worker threads may in turn fail, abruptly terminate, and possibly be replaced.
zh_cn: 如果钩子 (hook) ，回调或回调方法抛出异常，则内部辅助线程将依次失败并突然终止。

source: If if were to be implemented, it would be deadlock-prone in much the manner of suspend().
zh_cn: 即使要实现，它也极有可能以 suspend() 方式被死锁。

source: If many mappings are to be stored in a HashMap instance, creating it with a sufficiently large capacity will allow the mappings to be stored more efficiently than letting it perform automatic rehashing as needed to grow the table.
zh_cn: 如果很多映射关系要存储在 HashMap 实例中，则相对于按需执行自动的 rehash 操作以增大表的容量来说，使用足够大的初始容量创建它将使得映射关系能更有效地存储。

source: If no Retention annotation is present on an annotation type declaration, the retention policy defaults to RetentionPolicy.CLASS.
zh_cn: 如果注释类型声明中不存在 Retention 注释，则保留策略默认为 RetentionPolicy.CLASS。

source: If no such object exists, the map should be "wrapped" using the Collections#synchronizedMap Collections.synchronizedMap method.
zh_cn: 如果不存在这样的对象，则应该使用 Collections#synchronizedMap Collections.synchronizedMap 方法来“包装”该映射。

source: If no such object exists, the map should be "wrapped" using the Collections.synchronizedMap method.
zh_cn: 如果不存在这样的对象，则应该使用 Collections.synchronizedMap 方法来“包装”该映射。

source: If no such value of k exists, then -1 is returned.
zh_cn: 如果不存在这样的值 k，则返回-1。

source: If no superclass has an annotation for this type, then the query will indicate that the class in question has no such annotation.
zh_cn: 如果没有超类具有该类型的注释，则查询将指示当前类没有这样的注释。

source: If not otherwise specified, a defaultThreadFactory() is used, that creates threads to all be in the same ThreadGroup and with the same NORM_PRIORITY priority and non-daemon status.
zh_cn: 如果没有另外说明，则在同一个 ThreadGroup 中一律使用 defaultThreadFactory() 创建线程，并且这些线程具有相同的 NORM_PRIORITY 优先级和非守护进程状态。

source: If null, allocates in accord with initial capacity target held in field threshold.
zh_cn: 如果为空，则根据 threshold 中保存的阈值对应的初始容量进行分配。

source: If one is available without further delay then it is removed from the queue and returned.
zh_cn: 如果存在一个立即可用的对象，则从该队列中移除此对象并返回。

source: If such a meta-annotation is present, the compiler will enforce the specified usage restriction.
zh_cn: 如果存在这样的元注释，则编译器强制实施指定的使用限制。

source: If such synchronization is required then it is recommended that StringBuffer be used.
zh_cn: 如果需要这样的同步，则建议使用 StringBuffer。

source: If tasks frequently block (for example if they are I/O bound), a system may be able to schedule time for more threads than you otherwise allow.
zh_cn: 如果任务频繁阻塞（例如，如果它们是 I/O 边界），则系统可能为超过您许可的更多线程安排时间。

source: If the char value at (index - 1) is in the low-surrogate range, (index - 2) is not negative, and the char value at (index - 2) is in the high-surrogate range, then the supplementary code point value of the surrogate pair is returned.
zh_cn: 如果 (index - 1) 处的 char 值属于低代理项范围，则 (index - 2) 为非负；如果(index - 2) 处的 char 值属于高代理项范围，则返回该代理项对的增补代码点值。

source: If the char value specified at the given index is in the high-surrogate range, the following index is less than the length of this sequence, and the char value at the following index is in the low-surrogate range, then the supplementary code point corresponding to this surrogate pair is returned.
zh_cn: 如果给定的索引指定的 char 值属于高代理项范围，则后续索引小于此序列的长度；如果后续索引处的 char 值属于低代理项范围，则返回该代理项对对应的增补代码点。

source: If the char value specified by the index is a surrogate, the surrogate value is returned.
zh_cn: 如果索引指定的 char 值是代理项，则返回代理项值。

source: If the minimumCapacity argument is nonpositive, this method takes no action and simply returns.
zh_cn: 如果 minimumCapacity 参数为非正数，则此方法不执行任何操作并返回。

source: If the newLength argument is greater than or equal to the current length, sufficient null characters ('\u0000') are appended so that length becomes the newLength argument.
zh_cn: 如果 newLength 参数大于或等于当前长度，则将追加有效的 null 字符 ('\u0000')，使长度满足 newLength 参数。

source: If the interfaces array argument or any of its elements are null, a NullPointerException will be thrown.
zh_cn: 如果 interfaces 数组参数或其任何元素为 null，则将抛出 NullPointerException。

source: If the invoke method throws a checked exception that is not assignable to any of the exception types declared by the method in one of the proxy interfaces that it can be invoked through, then an unchecked UndeclaredThrowableException will be thrown by the invocation on the proxy instance.
zh_cn: 如果 invoke 方法抛出一个经过检查的异常，该异常没有指派给任何由一个代理接口（可以通过它调用）中的方法声明的异常类型，那么该代理实例上的调用将抛出一个未经检查的 UndeclaredThrowableException。

source: If the char value at index - 1 is an unpaired low-surrogate or a high-surrogate, the surrogate value is returned.
zh_cn: 如果 index - 1 处的 char 值是未配对的低（高）代理项，则返回代理项值。

source: If the ThreadGroup object has no special requirements for dealing with the exception, it can forward the invocation to the default uncaught exception handler.
zh_cn: 如果 ThreadGroup 对象对处理异常没有什么特殊要求，那么它可以将调用转发给默认的未捕获异常处理程序。

source: If the buffer is larger than necessary to hold its current sequence of characters, then it may be resized to become more space efficient.
zh_cn: 如果缓冲区大于保存当前字符序列所需的存储空间，则将重新调整其大小，以便更好地利用存储空间。

source: If the class or interface represented by this Class object is a member of another class, returns the Class object representing the class in which it was declared.
zh_cn: 如果此 Class 对象所表示的类或接口是另一个类的成员，则返回的 Class 对象表示该对象的声明类。

source: If the current capacity is less than the argument, then a new internal array is allocated with greater capacity.
zh_cn: 如果当前容量小于参数，则可分配一个更大容量的新内部数组。

source: If the current thread is interrupted by any thread before or while it is waiting, then an InterruptedException is thrown.
zh_cn: 如果当前线程在等待之前或在等待时被任何线程 中断，则会抛出 InterruptedException。

source: If the current tree appears to have too few nodes, the bin is converted back to a plain bin.
zh_cn: 如果当前树看起来节点太少，则该 bin 将转换回普通 bin。
